In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (2.2.2)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy>=1.23.2 in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (from pandas) (2.1.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
pip install sqlalchemy pymysql

Requirement already satisfied: sqlalchemy in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (2.0.32)
Requirement already satisfied: pymysql in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (1.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (from sqlalchemy) (3.0.3)
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (2.9.9)
Note: you may need to restart the kernel to use updated packages.

In [4]:
pip install pyodbc

Requirement already satisfied: pyodbc in c:\users\bomodambo\documents\10alytics\_portfolio projects\wikipedia data scraping\venv\lib\site-packages (5.1.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
#Import necessary libraries
import requests
from bs4 import BeautifulSoup
import csv
import json
import pandas as pd
from sqlalchemy import create_engine
import pymysql
import psycopg2
import pyodbc

# Extraction Layer

In [6]:
#Extract data from URL
response = requests.get('https://en.wikipedia.org/wiki/List_of_largest_universities')

In [7]:
soup = BeautifulSoup(response.content)

In [8]:
table = soup.find('table', attrs={'class': 'sortable'}) #will give the first element that matches the criteria that you specify

In [9]:
trs = table.findAll('tr')

In [10]:
#To print the text of html items
for item in trs[0].findAll('th'):
    print(item.text.strip()) #strip() to remove extra spaces

Country
University
Founded
Type
Enrollment
Ref

In [11]:
columns = []
for item in trs[0].findAll('th'):
    print(item.text.strip())
    columns.append(item.text.strip())

Country
University
Founded
Type
Enrollment
Ref

In [12]:
columns

['Country', 'University', 'Founded', 'Type', 'Enrollment', 'Ref']

In [13]:
columns = list(map(lambda x: x.text.strip(), trs[0].findAll('th')))
columns[-1] = "Link"

In [14]:
columns

['Country', 'University', 'Founded', 'Type', 'Enrollment', 'Link']

In [15]:
rows = trs[1:]

In [16]:
rows[0]

<tr>
<td><span class="flagicon"><span class="mw-image-border" typeof="mw:File"><span><img alt="" class="mw-file-element" data-file-height="500" data-file-width="700" decoding="async" height="15" src="//upload.wikimedia.org/wikipedia/commons/thumb/3/36/Flag_of_Albania.svg/21px-Flag_of_Albania.svg.png" srcset="//upload.wikimedia.org/wikipedia/commons/thumb/3/36/Flag_of_Albania.svg/32px-Flag_of_Albania.svg.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/3/36/Flag_of_Albania.svg/42px-Flag_of_Albania.svg.png 2x" width="21"/></span></span> </span><a href="/wiki/Albania" title="Albania">Albania</a>
</td>
<td><a href="/wiki/University_of_Tirana" title="University of Tirana">University of Tirana</a>
</td>
<td style="text-align: right;">1957
</td>
<td>Public
</td>
<td style="text-align: right;">35,000
</td>
<td>
</td></tr>

In [17]:
rows[0].findAll('td')

[<td><span class="flagicon"><span class="mw-image-border" typeof="mw:File"><span><img alt="" class="mw-file-element" data-file-height="500" data-file-width="700" decoding="async" height="15" src="//upload.wikimedia.org/wikipedia/commons/thumb/3/36/Flag_of_Albania.svg/21px-Flag_of_Albania.svg.png" srcset="//upload.wikimedia.org/wikipedia/commons/thumb/3/36/Flag_of_Albania.svg/32px-Flag_of_Albania.svg.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/3/36/Flag_of_Albania.svg/42px-Flag_of_Albania.svg.png 2x" width="21"/></span></span> </span><a href="/wiki/Albania" title="Albania">Albania</a>
 </td>,
 <td><a href="/wiki/University_of_Tirana" title="University of Tirana">University of Tirana</a>
 </td>,
 <td style="text-align: right;">1957
 </td>,
 <td>Public
 </td>,
 <td style="text-align: right;">35,000
 </td>,
 <td>
 </td>]

In [18]:
list(map(lambda x: x.text.strip(), rows[0].findAll('td')))

['Albania', 'University of Tirana', '1957', 'Public', '35,000', '']

In [19]:
rows[0].findAll('td')[1].a.attrs['href'].lstrip('/')

'wiki/University_of_Tirana'

In [20]:
def extract_row(tr):
    row_soup_list = tr.findAll('td')
    row = list(map(lambda x: x.text.strip(),row_soup_list))
    if len(row)<6:
        row.append('')
    link = row_soup_list[1].a.attrs['href'].lstrip('/')
    row[-1] = f'https://en.wikipedia.org/{link}' if link else ''
    return row

In [21]:
extract_row(rows[35])

['Japan',
 'Nihon University',
 '1889',
 'Private',
 '70,667',
 'https://en.wikipedia.org/wiki/Nihon_University']

In [22]:
data = list(map(extract_row, rows))

In [23]:
with open ('universities.csv', 'w', newline='') as file:
    csvwriter = csv.writer(file)
    csvwriter.writerow(columns)
    csvwriter.writerows(data)

In [24]:
with open ('universities.json', 'w') as file:
    json.dump(data, file, indent=4)

# Transformation Layer

In [25]:
df = pd.DataFrame(data=data, columns=columns)

In [26]:
df

,Country,University,Founded,Type,Enrollment,Link
0,Albania,University of Tirana,1957,Public,"35,000",https://en.wikipedia.org/wiki/University_of_Ti...
1,Algeria,Constantine University,1978,Public,"85,000",https://en.wikipedia.org/wiki/List_of_universi...
2,Angola,Agostinho Neto University,1962,Public,"29,827",https://en.wikipedia.org/wiki/Agostinho_Neto_U...
3,Argentina,University of Buenos Aires,1821,Public,"311,175",https://en.wikipedia.org/wiki/University_of_Bu...
4,Australia,Monash University,1958,Public,"73,807",https://en.wikipedia.org/wiki/Monash_University
...,...,...,...,...,...,...
65,Turkey,Anadolu University,1958,Public,"1,969,733",https://en.wikipedia.org/wiki/Anadolu_University
66,United Kingdom,Open University,1969,Public,"253,075",https://en.wikipedia.org/wiki/Open_University
67,United States,Texas A&M University,1876,Public,"73,284",https://en.wikipedia.org/wiki/Texas_A%26M_Univ...
68,Uruguay,University of the Republic,1949,Public,"144,108",https://en.wikipedia.org/wiki/University_of_th...
69,Venezuela,Universidad Central de Venezuela,1721,Public,"41,059",https://en.wikipedia.org/wiki/Universidad_Cent...

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     70 non-null     object
 1   University  70 non-null     object
 2   Founded     70 non-null     object
 3   Type        70 non-null     object
 4   Enrollment  70 non-null     object
 5   Link        70 non-null     object
dtypes: object(6)
memory usage: 3.4+ KB

In [28]:
df['Founded'].values

array(['1957', '1978', '1962', '1821', '1958', '1365', '1992', '1921',
       '1425', '1949', '1982', '1970', '1888', '1827', '1960', '1867',
       '1940', '1669', '1928', '1538', '1950', '1632', '1640', '1939',
       '1998', '1837', '1676', '1937', '1911', '1985', '1984', '1982',
       '1834', '1956', '1303', '1889', '1970', '1999', '1579', '2000',
       '1956', '1551', '1959', '1632', '1883', '1943', '1996', '2002',
       '1551', '1904', '1816', '1288', '1991', '1992', '1976', '1905',
       '1919', '1873', '1972', '1972', '1666', '1833[34]', '1928', '1971',
       '1960', '1958', '1969', '1876', '1949', '1721'], dtype=object)

In [29]:
#To extract only the first four digits for the year (as you can see 1833 has extra characters)
df['Founded'] = df['Founded'].str.extract("(\d{4})")

In [30]:
df['Founded'].values

array(['1957', '1978', '1962', '1821', '1958', '1365', '1992', '1921',
       '1425', '1949', '1982', '1970', '1888', '1827', '1960', '1867',
       '1940', '1669', '1928', '1538', '1950', '1632', '1640', '1939',
       '1998', '1837', '1676', '1937', '1911', '1985', '1984', '1982',
       '1834', '1956', '1303', '1889', '1970', '1999', '1579', '2000',
       '1956', '1551', '1959', '1632', '1883', '1943', '1996', '2002',
       '1551', '1904', '1816', '1288', '1991', '1992', '1976', '1905',
       '1919', '1873', '1972', '1972', '1666', '1833', '1928', '1971',
       '1960', '1958', '1969', '1876', '1949', '1721'], dtype=object)

In [31]:
#To convert the Founded column datatype from string to integers (for years)
df['Founded'] = df['Founded'].astype(int)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     70 non-null     object
 1   University  70 non-null     object
 2   Founded     70 non-null     int64
 3   Type        70 non-null     object
 4   Enrollment  70 non-null     object
 5   Link        70 non-null     object
dtypes: int64(1), object(5)
memory usage: 3.4+ KB

In [33]:
df[df['Link'].isnull()]

Empty DataFrame
Columns: [Country, University, Founded, Type, Enrollment, Link]
Index: []

In [34]:
df['Enrollment'].values

array(['35,000', '85,000', '29,827', '311,175', '73,807', '91,000',
       '2,097,182', '25,500', '55,484', '30,866', '32,000', '215,000',
       '18 911', '84,000', '80,000', '53,581', '42,750', '72,480',
       '43,600', '170,530', '170,000', '14,000', '36,500', '350,000[8]',
       '130,000', '104,000', '124,000', '32,000', '13,782', '7,140,000',
       '1,045,665 (total) as per 2019/2020[14]\n311,028 (active) as per 4 November 2020 [15]',
       '1,000,000', '32,900', '26,023', '112,564', '70,667', '84,000',
       '41,833', '23,606', '10,373', '100,000', '349,515', '604,437',
       '31,186', '33,050', '50,000', '39,000', '165,000', '37,032',
       '68,249', '44,400', '48,100', '311,928', '200,000', '177,234',
       '38,300', '48,821', '328,179', '173,758', '260,079', '30,646',
       '26,356', '31,758', '525,000', '60,000+', '1,969,733', '253,075',
       '73,284', '144,108', '41,059'], dtype=object)

In [35]:
df['Enrollment'] = df['Enrollment'].str.replace(' ', ',')

In [36]:
df['Enrollment'] = df['Enrollment'].str.extract("(\d{1,3}(?:,\d{1,3})*)")

In [37]:
df['Enrollment'].values

array(['35,000', '85,000', '29,827', '311,175', '73,807', '91,000',
       '2,097,182', '25,500', '55,484', '30,866', '32,000', '215,000',
       '18,911', '84,000', '80,000', '53,581', '42,750', '72,480',
       '43,600', '170,530', '170,000', '14,000', '36,500', '350,000',
       '130,000', '104,000', '124,000', '32,000', '13,782', '7,140,000',
       '1,045,665', '1,000,000', '32,900', '26,023', '112,564', '70,667',
       '84,000', '41,833', '23,606', '10,373', '100,000', '349,515',
       '604,437', '31,186', '33,050', '50,000', '39,000', '165,000',
       '37,032', '68,249', '44,400', '48,100', '311,928', '200,000',
       '177,234', '38,300', '48,821', '328,179', '173,758', '260,079',
       '30,646', '26,356', '31,758', '525,000', '60,000', '1,969,733',
       '253,075', '73,284', '144,108', '41,059'], dtype=object)

In [38]:
df['Enrollment'] = df['Enrollment'].str.replace(',', '')

In [39]:
df.head()

,Country,University,Founded,Type,Enrollment,Link
0,Albania,University of Tirana,1957,Public,35000,https://en.wikipedia.org/wiki/University_of_Ti...
1,Algeria,Constantine University,1978,Public,85000,https://en.wikipedia.org/wiki/List_of_universi...
2,Angola,Agostinho Neto University,1962,Public,29827,https://en.wikipedia.org/wiki/Agostinho_Neto_U...
3,Argentina,University of Buenos Aires,1821,Public,311175,https://en.wikipedia.org/wiki/University_of_Bu...
4,Australia,Monash University,1958,Public,73807,https://en.wikipedia.org/wiki/Monash_University

In [40]:
#To convert the Enrolment column datatype from string to integer
df['Enrollment'] = df['Enrollment'].astype(int)

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     70 non-null     object
 1   University  70 non-null     object
 2   Founded     70 non-null     int64
 3   Type        70 non-null     object
 4   Enrollment  70 non-null     int64
 5   Link        70 non-null     object
dtypes: int64(2), object(4)
memory usage: 3.4+ KB

In [42]:
df['Country'].values

array(['Albania', 'Algeria', 'Angola', 'Argentina', 'Australia',
       'Austria', 'Bangladesh', 'Belarus', 'Belgium',
       'Bosnia and Herzegovina', 'Botswana', 'Brazil', 'Bulgaria',
       'Canada', 'China', 'Colombia', 'Costa Rica', 'Croatia', 'Denmark',
       'Dominican Republic', 'Egypt', 'Estonia', 'Finland', 'France',
       'Germany', 'Greece', 'Guatemala', 'Hong Kong', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Ireland', 'Israel', 'Italy', 'Japan',
       'Kenya', 'Kosovo', 'Lithuania', 'Macau', 'Malaysia', 'Mexico',
       'Nepal', 'Netherlands', 'New Zealand', 'North Macedonia', 'Norway',
       'Pakistan', 'Peru', 'Philippines', 'Poland', 'Portugal', 'Romania',
       'Russia', 'Saudi Arabia', 'Singapore', 'Slovenia', 'South Africa',
       'South Korea', 'Spain', 'Sweden', 'Switzerland', 'Taiwan',
       'Thailand', 'Trinidad and Tobago', 'Turkey', 'United Kingdom',
       'United States', 'Uruguay', 'Venezuela'], dtype=object)

In [43]:
df.to_csv('universities-clean.csv', index=False)

# Loading Layer

### Loading into MySQL using Docker

In [44]:
#Connect to the database
conn = pymysql.Connect(
    host= 'localhost',
    port= 3306,
    password= 'wikiuserpassword',
    user= 'wikiuser',
    database = 'wikidb',
    client_flag=pymysql.constants.CLIENT.MULTI_STATEMENTS #to read multiple statements in my sql file like DROP TABLE; CREATE TABLE;
)

RuntimeError: 'cryptography' package is required for sha256_password or caching_sha2_password auth methods

In [45]:
#Create cursor to interact with the database
cursor = conn.cursor()

In [46]:
cursor.execute("SHOW TABLES;")

0

In [47]:
cursor.fetchall()

()

In [48]:
create_query = open('./sql/mysql_create_tables.sql')
create_query = create_query.read()
create_query

'DROP TABLE IF EXISTS universities;\n\nCREATE TABLE universities(\n        id BIGINT AUTO_INCREMENT PRIMARY KEY NOT NULL,\n        country VARCHAR (255) NOT NULL,\n        university_name VARCHAR (255) NOT NULL,\n        founded INT NOT NULL,\n        `type` VARCHAR (255) NOT NULL,\n        enrollment BIGINT NOT NULL,\n        link VARCHAR (255) NOT NULL,\n        CONSTRAINT unique_combination UNIQUE(country, university_name)\n);'

In [49]:
cursor.execute(create_query)

0

In [50]:
#Load data into tables already created
mysql_data = list(df.itertuples(index=None, name=None))

In [51]:
tuple(mysql_data)

(('Albania',
  'University of Tirana',
  1957,
  'Public',
  35000,
  'https://en.wikipedia.org/wiki/University_of_Tirana'),
 ('Algeria',
  'Constantine University',
  1978,
  'Public',
  85000,
  'https://en.wikipedia.org/wiki/List_of_universities_in_Algeria'),
 ('Angola',
  'Agostinho Neto University',
  1962,
  'Public',
  29827,
  'https://en.wikipedia.org/wiki/Agostinho_Neto_University'),
 ('Argentina',
  'University of Buenos Aires',
  1821,
  'Public',
  311175,
  'https://en.wikipedia.org/wiki/University_of_Buenos_Aires'),
 ('Australia',
  'Monash University',
  1958,
  'Public',
  73807,
  'https://en.wikipedia.org/wiki/Monash_University'),
 ('Austria',
  'University of Vienna',
  1365,
  'Public',
  91000,
  'https://en.wikipedia.org/wiki/University_of_Vienna'),
 ('Bangladesh',
  'National University, Bangladesh',
  1992,
  'Public',
  2097182,
  'https://en.wikipedia.org/wiki/National_University,_Bangladesh'),
 ('Belarus',
  'Belarusian State University',
  1921,
  'Public',
  25500,
  'https://en.wikipedia.org/wiki/Belarusian_State_University'),
 ('Belgium',
  'KU Leuven',
  1425,
  'Private, state-funded',
  55484,
  'https://en.wikipedia.org/wiki/Katholieke_Universiteit_Leuven'),
 ('Bosnia and Herzegovina',
  'University of Sarajevo',
  1949,
  'Public',
  30866,
  'https://en.wikipedia.org/wiki/University_of_Sarajevo'),
 ('Botswana',
  'University of Botswana',
  1982,
  'Public',
  32000,
  'https://en.wikipedia.org/wiki/University_of_Botswana'),
 ('Brazil',
  'Estácio de Sá University',
  1970,
  'Private',
  215000,
  'https://en.wikipedia.org/wiki/Est%C3%A1cio_de_S%C3%A1_University'),
 ('Bulgaria',
  'Sofia University',
  1888,
  'Public',
  18911,
  'https://en.wikipedia.org/wiki/Sofia_University'),
 ('Canada',
  'University of Toronto',
  1827,
  'Public',
  84000,
  'https://en.wikipedia.org/wiki/University_of_Toronto'),
 ('China',
  'Shanghai Open University',
  1960,
  'Public',
  80000,
  'https://en.wikipedia.org/wiki/Shanghai_Open_University'),
 ('Colombia',
  'National University of Colombia',
  1867,
  'Public',
  53581,
  'https://en.wikipedia.org/wiki/National_University_of_Colombia'),
 ('Costa Rica',
  'Universidad de Costa Rica',
  1940,
  'Public',
  42750,
  'https://en.wikipedia.org/wiki/Universidad_de_Costa_Rica'),
 ('Croatia',
  'University of Zagreb',
  1669,
  'Public',
  72480,
  'https://en.wikipedia.org/wiki/University_of_Zagreb'),
 ('Denmark',
  'Aarhus University',
  1928,
  'Public',
  43600,
  'https://en.wikipedia.org/wiki/Aarhus_University'),
 ('Dominican Republic',
  'Universidad Autónoma de Santo Domingo',
  1538,
  'Public',
  170530,
  'https://en.wikipedia.org/wiki/Universidad_Aut%C3%B3noma_de_Santo_Domingo'),
 ('Egypt',
  'Ain Shams University',
  1950,
  'Public',
  170000,
  'https://en.wikipedia.org/wiki/Ain_Shams_University'),
 ('Estonia',
  'University of Tartu',
  1632,
  'Public',
  14000,
  'https://en.wikipedia.org/wiki/University_of_Tartu'),
 ('Finland',
  'University of Helsinki',
  1640,
  'Public',
  36500,
  'https://en.wikipedia.org/wiki/University_of_Helsinki'),
 ('France',
  "Centre national d'enseignement à distance",
  1939,
  'Public',
  350000,
  'https://en.wikipedia.org/wiki/Centre_national_d%27enseignement_%C3%A0_distance'),
 ('Germany',
  'IU International University of Applied Sciences',
  1998,
  'Private',
  130000,
  'https://en.wikipedia.org/wiki/IU_International_University_of_Applied_Sciences'),
 ('Greece',
  'National and Kapodistrian University of Athens',
  1837,
  'Public',
  104000,
  'https://en.wikipedia.org/wiki/National_and_Kapodistrian_University_of_Athens'),
 ('Guatemala',
  'Universidad de San Carlos de Guatemala',
  1676,
  'Public',
  124000,
  'https://en.wikipedia.org/wiki/Universidad_de_San_Carlos_de_Guatemala'),
 ('Hong Kong',
  'Hong Kong Polytechnic University',
  1937,
  'Public',
  32000,
  'https://en.wikipedia.org/wiki/Hong_Kong_Polytechnic_University'),
 ('Iceland',
  'University of Iceland',
  1911,
  'Public',
  13782,
  'https://en.wikipedia.org/wiki/University_of_Iceland'),
 ('India',
  'Indira Gandhi National Open University',
  1985,
  'Public',
  7140000,
  'https://en.wikipedia.org/wiki/Indira_Gandhi_National_Open_University'),
 ('Indonesia',
  'Universitas Terbuka',
  1984,
  'Public',
  1045665,
  'https://en.wikipedia.org/wiki/Universitas_Terbuka'),
 ('Iran',
  'Islamic Azad University',
  1982,
  'Semi-private',
  1000000,
  'https://en.wikipedia.org/wiki/Islamic_Azad_University'),
 ('Ireland',
  'University College Dublin',
  1834,
  'Public (formerly private)',
  32900,
  'https://en.wikipedia.org/wiki/University_College_Dublin'),
 ('Israel',
  'Tel Aviv University',
  1956,
  'Public',
  26023,
  'https://en.wikipedia.org/wiki/Tel_Aviv_University'),
 ('Italy',
  'Sapienza University of Rome',
  1303,
  'Public',
  112564,
  'https://en.wikipedia.org/wiki/Sapienza_University_of_Rome'),
 ('Japan',
  'Nihon University',
  1889,
  'Private',
  70667,
  'https://en.wikipedia.org/wiki/Nihon_University'),
 ('Kenya',
  'University of Nairobi',
  1970,
  'Public',
  84000,
  'https://en.wikipedia.org/wiki/University_of_Nairobi'),
 ('Kosovo',
  'Universiteti i Prishtinës',
  1999,
  'Public',
  41833,
  'https://en.wikipedia.org/wiki/Universiteti_i_Prishtin%C3%ABs'),
 ('Lithuania',
  'Vilnius University',
  1579,
  'Public',
  23606,
  'https://en.wikipedia.org/wiki/Vilnius_University'),
 ('Macau',
  'Macau University of Science and Technology',
  2000,
  'Private',
  10373,
  'https://en.wikipedia.org/wiki/Macau_University_of_Science_and_Technology'),
 ('Malaysia',
  'Universiti Teknologi MARA',
  1956,
  'Public',
  100000,
  'https://en.wikipedia.org/wiki/Universiti_Teknologi_MARA'),
 ('Mexico',
  'National Autonomous University of Mexico',
  1551,
  'Public',
  349515,
  'https://en.wikipedia.org/wiki/National_Autonomous_University_of_Mexico'),
 ('Nepal',
  'Tribhuvan University',
  1959,
  'Public',
  604437,
  'https://en.wikipedia.org/wiki/Tribhuvan_University'),
 ('Netherlands',
  'University of Amsterdam',
  1632,
  'Public',
  31186,
  'https://en.wikipedia.org/wiki/University_of_Amsterdam'),
 ('New Zealand',
  'University of Auckland',
  1883,
  'Public',
  33050,
  'https://en.wikipedia.org/wiki/University_of_Auckland'),
 ('North Macedonia',
  'University of Skopje',
  1943,
  'Public',
  50000,
  'https://en.wikipedia.org/wiki/University_of_Skopje'),
 ('Norway',
  'Norwegian University of Science and Technology',
  1996,
  'Public',
  39000,
  'https://en.wikipedia.org/wiki/Norwegian_University_of_Science_and_Technology'),
 ('Pakistan',
  'Virtual University of Pakistan',
  2002,
  'Public',
  165000,
  'https://en.wikipedia.org/wiki/Virtual_University_of_Pakistan'),
 ('Peru',
  'National University of San Marcos',
  1551,
  'Private',
  37032,
  'https://en.wikipedia.org/wiki/National_University_of_San_Marcos'),
 ('Philippines',
  'Polytechnic University of the Philippines',
  1904,
  'Public',
  68249,
  'https://en.wikipedia.org/wiki/Polytechnic_University_of_the_Philippines'),
 ('Poland',
  'University of Warsaw',
  1816,
  'Public',
  44400,
  'https://en.wikipedia.org/wiki/University_of_Warsaw'),
 ('Portugal',
  'University of Lisbon',
  1288,
  'Public',
  48100,
  'https://en.wikipedia.org/wiki/University_of_Lisbon'),
 ('Romania',
  'Spiru Haret University',
  1991,
  'Private',
  311928,
  'https://en.wikipedia.org/wiki/Spiru_Haret_University'),
 ('Russia',
  'Modern University for the Humanities',
  1992,
  'Private',
  200000,
  'https://en.wikipedia.org/wiki/Modern_University_for_the_Humanities'),
 ('Saudi Arabia',
  'King Abdulaziz University',
  1976,
  'Public',
  177234,
  'https://en.wikipedia.org/wiki/King_Abdulaziz_University'),
 ('Singapore',
  'National University of Singapore',
  1905,
  'Public',
  38300,
  'https://en.wikipedia.org/wiki/National_University_of_Singapore'),
 ('Slovenia',
  'University of Ljubljana',
  1919,
  'Public',
  48821,
  'https://en.wikipedia.org/wiki/University_of_Ljubljana'),
 ('South Africa',
  'University of South Africa',
  1873,
  'Public',
  328179,
  'https://en.wikipedia.org/wiki/University_of_South_Africa'),
 ('South Korea',
  'Korea National Open University',
  1972,
  'Public',
  173758,
  'https://en.wikipedia.org/wiki/Korea_National_Open_University'),
 ('Spain',
  'National University of Distance Education',
  1972,
  'Public',
  260079,
  'https://en.wikipedia.org/wiki/National_University_of_Distance_Education'),
 ('Sweden',
  'Lund University',
  1666,
  'Public',
  30646,
  'https://en.wikipedia.org/wiki/Lund_University'),
 ('Switzerland',
  'University of Zurich',
  1833,
  'Public',
  26356,
  'https://en.wikipedia.org/wiki/University_of_Zurich'),
 ('Taiwan',
  'National Taiwan University',
  1928,
  'Public',
  31758,
  'https://en.wikipedia.org/wiki/National_Taiwan_University'),
 ('Thailand',
  'Ramkhamhaeng University',
  1971,
  'Public',
  525000,
  'https://en.wikipedia.org/wiki/Ramkhamhaeng_University'),
 ('Trinidad and Tobago',
  'University of the West Indies',
  1960,
  'Public',
  60000,
  'https://en.wikipedia.org/wiki/University_of_the_West_Indies'),
 ('Turkey',
  'Anadolu University',
  1958,
  'Public',
  1969733,
  'https://en.wikipedia.org/wiki/Anadolu_University'),
 ('United Kingdom',
  'Open University',
  1969,
  'Public',
  253075,
  'https://en.wikipedia.org/wiki/Open_University'),
 ('United States',
  'Texas A&M University',
  1876,
  'Public',
  73284,
  'https://en.wikipedia.org/wiki/Texas_A%26M_University'),
 ('Uruguay',
  'University of the Republic',
  1949,
  'Public',
  144108,
  'https://en.wikipedia.org/wiki/University_of_the_Republic'),
 ('Venezuela',
  'Universidad Central de Venezuela',
  1721,
  'Public',
  41059,
  'https://en.wikipedia.org/wiki/Universidad_Central_de_Venezuela'))

In [52]:
sql_engine = create_engine("mysql+pymysql://", creator=lambda: conn)

In [53]:
pd.read_sql("SELECT * FROM universities;", con=sql_engine)

Empty DataFrame
Columns: [id, country, university_name, founded, type, enrollment, link]
Index: []

In [54]:
merge_query_file = open('./sql/mysql_upsert.sql')
merge_query = merge_query_file.read()
merge_query

'INSERT INTO universities (country, university_name, founded, `type`, enrollment, link)\nVALUES (%s, %s, %s, %s, %s, %s) \nON DUPLICATE KEY UPDATE\n    founded=VALUES(founded),\n    `type`=VALUES(`type`),\n    enrollment=VALUES(enrollment),\n    link=VALUES(link);\n'

In [55]:
cursor.executemany(merge_query, mysql_data)

70

In [56]:
conn.commit()

In [57]:
pd.read_sql("SELECT * FROM universities;", con=sql_engine)

,id,country,university_name,founded,type,enrollment,link
0,1,Albania,University of Tirana,1957,Public,35000,https://en.wikipedia.org/wiki/University_of_Ti...
1,2,Algeria,Constantine University,1978,Public,85000,https://en.wikipedia.org/wiki/List_of_universi...
2,3,Angola,Agostinho Neto University,1962,Public,29827,https://en.wikipedia.org/wiki/Agostinho_Neto_U...
3,4,Argentina,University of Buenos Aires,1821,Public,311175,https://en.wikipedia.org/wiki/University_of_Bu...
4,5,Australia,Monash University,1958,Public,73807,https://en.wikipedia.org/wiki/Monash_University
...,...,...,...,...,...,...,...
65,66,Turkey,Anadolu University,1958,Public,1969733,https://en.wikipedia.org/wiki/Anadolu_University
66,67,United Kingdom,Open University,1969,Public,253075,https://en.wikipedia.org/wiki/Open_University
67,68,United States,Texas A&M University,1876,Public,73284,https://en.wikipedia.org/wiki/Texas_A%26M_Univ...
68,69,Uruguay,University of the Republic,1949,Public,144108,https://en.wikipedia.org/wiki/University_of_th...
69,70,Venezuela,Universidad Central de Venezuela,1721,Public,41059,https://en.wikipedia.org/wiki/Universidad_Cent...

### Loading Data into Postgres Database

In [58]:
df.head()

,Country,University,Founded,Type,Enrollment,Link
0,Albania,University of Tirana,1957,Public,35000,https://en.wikipedia.org/wiki/University_of_Ti...
1,Algeria,Constantine University,1978,Public,85000,https://en.wikipedia.org/wiki/List_of_universi...
2,Angola,Agostinho Neto University,1962,Public,29827,https://en.wikipedia.org/wiki/Agostinho_Neto_U...
3,Argentina,University of Buenos Aires,1821,Public,311175,https://en.wikipedia.org/wiki/University_of_Bu...
4,Australia,Monash University,1958,Public,73807,https://en.wikipedia.org/wiki/Monash_University

In [61]:
conn = psycopg2.connect(
    host = 'localhost',
    port = 5435,
    user = 'wikiuser',
    password = 'wikiuserpassword',
    database = 'wikidb'
)

In [62]:
cursor = conn.cursor()

In [68]:
create_query_file = open('./sql/postgres_create_tables.sql')
create_query = create_query_file.read()
create_query

'DROP TABLE IF EXISTS universities;\n\nCREATE TABLE universities(\n        id SERIAL PRIMARY KEY,\n        country VARCHAR (255) NOT NULL,\n        university_name VARCHAR (255) NOT NULL,\n        founded INT NOT NULL,\n        type VARCHAR (255) NOT NULL,\n        enrollment BIGINT NOT NULL,\n        link VARCHAR (255) NOT NULL,\n        CONSTRAINT unique_combination UNIQUE(country, university_name)\n);'

In [70]:
#conn.rollback()

In [71]:
cursor.execute(create_query)

In [72]:
conn.commit()

In [73]:
postgres_engine = create_engine("postgresql+psycopg2://", creator=lambda: conn)

In [74]:
pd.read_sql("SELECT * FROM universities;", con=postgres_engine)

Empty DataFrame
Columns: [id, country, university_name, founded, type, enrollment, link]
Index: []

In [75]:
postgres_data = list(df.itertuples(name=None, index=None))

In [81]:
merge_query_file = open('./sql/postgres_upsert.sql')
merge_query = merge_query_file.read()
merge_query

'INSERT INTO universities (country, university_name, founded, type, enrollment, link)\nVALUES (%s, %s, %s, %s, %s, %s) \nON CONFLICT(country, university_name) DO UPDATE\nSET\n    founded=EXCLUDED.founded,\n    type=EXCLUDED.type,\n    enrollment=EXCLUDED.enrollment,\n    link=EXCLUDED.link;'

In [84]:
cursor.executemany(merge_query, postgres_data)

In [83]:
#conn.rollback()

In [85]:
conn.commit()

In [86]:
pd.read_sql("SELECT * FROM universities;", con=postgres_engine)

,id,country,university_name,founded,type,enrollment,link
0,1,Albania,University of Tirana,1957,Public,35000,https://en.wikipedia.org/wiki/University_of_Ti...
1,2,Algeria,Constantine University,1978,Public,85000,https://en.wikipedia.org/wiki/List_of_universi...
2,3,Angola,Agostinho Neto University,1962,Public,29827,https://en.wikipedia.org/wiki/Agostinho_Neto_U...
3,4,Argentina,University of Buenos Aires,1821,Public,311175,https://en.wikipedia.org/wiki/University_of_Bu...
4,5,Australia,Monash University,1958,Public,73807,https://en.wikipedia.org/wiki/Monash_University
...,...,...,...,...,...,...,...
65,66,Turkey,Anadolu University,1958,Public,1969733,https://en.wikipedia.org/wiki/Anadolu_University
66,67,United Kingdom,Open University,1969,Public,253075,https://en.wikipedia.org/wiki/Open_University
67,68,United States,Texas A&M University,1876,Public,73284,https://en.wikipedia.org/wiki/Texas_A%26M_Univ...
68,69,Uruguay,University of the Republic,1949,Public,144108,https://en.wikipedia.org/wiki/University_of_th...
69,70,Venezuela,Universidad Central de Venezuela,1721,Public,41059,https://en.wikipedia.org/wiki/Universidad_Cent...

### Loading Data into SQL Server

In [45]:
SERVER = 'localhost,1433'
USERNAME = 'sa'
PASSWORD = 'Wikipassword_007'

In [46]:
connectionString = f'DRIVER={{ODBC Driver 17 for SQL Server}};SERVER={SERVER};UID={USERNAME};PWD={PASSWORD}'

In [47]:
conn = pyodbc.connect(connectionString)

In [48]:
cursor = conn.cursor()

In [49]:
cursor.execute("SELECT name FROM sys.databases;")

In [50]:
cursor.fetchall()

[('master',), ('tempdb',), ('model',), ('msdb',)]

In [55]:
conn.autocommit = True

In [56]:
cursor.execute("CREATE DATABASE wikidb;")

In [57]:
cursor.execute("USE wikidb")

In [58]:
create_query_file = open('./sql/sqlserver_create_tables.sql')
create_query = create_query_file.read()
create_query

'DROP TABLE IF EXISTS universities;\n\nCREATE TABLE universities(\n        id BIGINT IDENTITY(1,1) PRIMARY KEY,\n        country NVARCHAR (255) NOT NULL,\n        university_name NVARCHAR (255) NOT NULL,\n        founded INT NOT NULL,\n        type NVARCHAR (255) NOT NULL,\n        enrollment BIGINT NOT NULL,\n        link NVARCHAR (255) NOT NULL,\n        CONSTRAINT unique_combination UNIQUE(country, university_name)\n);'

In [59]:
cursor.execute(create_query)

In [60]:
sqlserver_engine = create_engine("mssql+pyodbc://", creator=lambda: conn)

In [63]:
pd.read_sql("SELECT * FROM universities;", con=sqlserver_engine)

Empty DataFrame
Columns: [id, country, university_name, founded, type, enrollment, link]
Index: []

In [65]:
# Creating a staging (temporary) table in the database instance
df.to_sql("#staging", index=False, con=sqlserver_engine)

70

In [66]:
pd.read_sql("SELECT * FROM #staging;", con=sqlserver_engine)

,Country,University,Founded,Type,Enrollment,Link
0,Albania,University of Tirana,1957,Public,35000,https://en.wikipedia.org/wiki/University_of_Ti...
1,Algeria,Constantine University,1978,Public,85000,https://en.wikipedia.org/wiki/List_of_universi...
2,Angola,Agostinho Neto University,1962,Public,29827,https://en.wikipedia.org/wiki/Agostinho_Neto_U...
3,Argentina,University of Buenos Aires,1821,Public,311175,https://en.wikipedia.org/wiki/University_of_Bu...
4,Australia,Monash University,1958,Public,73807,https://en.wikipedia.org/wiki/Monash_University
...,...,...,...,...,...,...
65,Turkey,Anadolu University,1958,Public,1969733,https://en.wikipedia.org/wiki/Anadolu_University
66,United Kingdom,Open University,1969,Public,253075,https://en.wikipedia.org/wiki/Open_University
67,United States,Texas A&M University,1876,Public,73284,https://en.wikipedia.org/wiki/Texas_A%26M_Univ...
68,Uruguay,University of the Republic,1949,Public,144108,https://en.wikipedia.org/wiki/University_of_th...
69,Venezuela,Universidad Central de Venezuela,1721,Public,41059,https://en.wikipedia.org/wiki/Universidad_Cent...

In [69]:
pd.read_sql("SELECT * FROM #staging WHERE country = 'France';", con=sqlserver_engine)

,Country,University,Founded,Type,Enrollment,Link
0,France,Centre national d'enseignement à distance,1939,Public,350000,https://en.wikipedia.org/wiki/Centre_national_...

In [75]:
merge_query_file = open('./sql/sqlserver_upsert.sql')
merge_query = merge_query_file.read()
merge_query

'MERGE INTO universities AS target\nUSING #staging AS source\nON (source.University = target.university_name AND source.Country = target.country)\nWHEN MATCHED THEN \n    UPDATE SET\n        target.founded = source.Founded,\n        target.type = source.Type,\n        target.enrollment = source.Enrollment,\n        target.link = source.Link\nWHEN NOT MATCHED BY TARGET THEN\n    INSERT (country, university_name, founded, type, enrollment, link)\n    VALUES (source.Country, source.University, source.Founded, source.Type, source.Enrollment, source.Link);'

In [76]:
cursor.execute(merge_query)

In [77]:
pd.read_sql("SELECT * FROM universities;", con=sqlserver_engine)

,id,country,university_name,founded,type,enrollment,link
0,1,Albania,University of Tirana,1957,Public,35000,https://en.wikipedia.org/wiki/University_of_Ti...
1,2,Algeria,Constantine University,1978,Public,85000,https://en.wikipedia.org/wiki/List_of_universi...
2,3,Angola,Agostinho Neto University,1962,Public,29827,https://en.wikipedia.org/wiki/Agostinho_Neto_U...
3,4,Argentina,University of Buenos Aires,1821,Public,311175,https://en.wikipedia.org/wiki/University_of_Bu...
4,5,Australia,Monash University,1958,Public,73807,https://en.wikipedia.org/wiki/Monash_University
...,...,...,...,...,...,...,...
65,66,Turkey,Anadolu University,1958,Public,1969733,https://en.wikipedia.org/wiki/Anadolu_University
66,67,United Kingdom,Open University,1969,Public,253075,https://en.wikipedia.org/wiki/Open_University
67,68,United States,Texas A&M University,1876,Public,73284,https://en.wikipedia.org/wiki/Texas_A%26M_Univ...
68,69,Uruguay,University of the Republic,1949,Public,144108,https://en.wikipedia.org/wiki/University_of_th...
69,70,Venezuela,Universidad Central de Venezuela,1721,Public,41059,https://en.wikipedia.org/wiki/Universidad_Cent...